import { getRandomInt } from "@helpers/random"
import { players } from "@store/players/players"

const namesFemale = [
    "Агнесс", "Ариель", "Алиша", "Агнесс", "Аманда", "Аннабет", "Алисия", "Апполин", "Беатрис", "Бэтла", "Белория",
    "Бэтла", "Бармия", "Брайана", "Виктория", "Верония", "Висконсия", "Виола", "Виолетта", "Гвиария", "Генриетта",
    "Гармония", "Гестия", "Диана", "Джоанна", "Джессика", "Джуди", "Даринетта", "Джейн", "Элизабет", "Энрика", "Эзетия",
    "Эланор", "Эсме", "Элис", "Элена", "Энн", "Эмма", "Ева", "Жозетта", "Жизель", "Жанна", "Жеана", "Жискета", "Жасмин",
    "Зарина", "Занвезия", "Ирида", "Инимика", "Иллиада", "Иннокентия", "Изабель", "Изабелла", "Карина", "Карменсита",
    "Катрин", "Клара", "Кларенс", "Калипсо", "Кармен", "Кейт", "Кэри", "Кетрин", "Кирстен", "Лиана", "Лира", "Луиза",
    "Лейла", "Ласкетия", "Леона", "Лив", "Моран", "Мэйлин", "Мэвен", "Мэри", "Мория", "Миранда", "Мэгги", "Мисора",
    "Нэнси", "Натали", "Наталия", "Найтири", "Наринэ", "Наоми", "Онтария", "Офелия", "Онерия", "Овлиция", "Олимпиада",
    "Пенелопа", "Пиония", "Полин", "Персея", "Пао", "Рамония", "Рамирия", "Рэйчел", "Роксана", "Роза", "Роуз", "Синтия",
    "Селена", "Симплиция", "Серенити", "Стелла", "Саю", "Скарлетт", "Тирис", "Титания", "Тирания", "Титания", "Тамия",
    "Тринни", "Уэди", "Урания", "Улания", "Фулона", "Филомена", "Феерия", "Фаина", "Флора", "Фауна", "Фрида", "Христина",
    "Хелен", "Хаара", "Халле", "Хейди", "Хилари", "Хизер", "Холли", "Чжоу", "Чао", "Шаэра", "Шиетта", "Шалия", "Шерлиз",
    "Юджия", "Юджина", "Юория", "Юстана", "Янна",
]

const namesMale = [
    "Аэлмар", "Аэлнесс", "Афкиллар", "Арравел", "Агмасс", "Андерс", "Алекс", "Антеон", "Айбер", "Бесталл", "Баэлнесс",
    "Боб", "Беон", "Бурбон", "Верронн", "Верллианн", "Вильгельм", "Вениамин", "Вандон", "Виктуар", "Гилдримм", "Гарри",
    "Гэри", "Гарольд", "Гордон", "Гаррисон", "Гудвин", "Джерласс", "Дик", "Доар", "Диплексий", "Джек", "Джордж", "Джоул",
    "Джекоб", "Джейкоб", "Эйлдар", "Эвари", "Эйревелл", "Элберт", "Эльберт", "Эдвард", "Энтони", "Жеан", "Жан", "Иладар",
    "Иррадион", "Иллирий", "Ингард", "Ивиникум", "Каиллан", "Кантил", "Келлфер", "Криан", "Кадмий", "Кадм", "Люциус",
    "Люций", "Луций", "Лекс", "Лэри", "Лакс", "Лайт", "Мэдисон", "Макс", "Майк", "Мик", "Мартин", "Мэтью", "Наиселл",
    "Натаниэль", "Нокс", "Нур", "Ниа", "Оливер", "Пармис", "Пер", "Поль", "Пауль", "Пьер", "Питер", "Ридесар",
    "Родислав", "Рамерий", "Ромео", "Рональд", "Ричард", "Роджер", "Саэллат", "Сехелис", "Селуанн", "Сольмир", "Сиэль",
    "Стив", "Седрик", "Сидо", "Титаний", "Тоберон", "Тиберий", "Тор", "Тейлор", "Улан", "Ург", "Уилл", "Ферммар",
    "Фаавел", "Феофил", "Фиделий", "Феб", "Харрин", "Шон", "Ялмир", "Янви", "Якоб", "Якин",
]

const names = [
    ...namesFemale,
    ...namesMale,
]

const dogNamesFemale = [
    "Ася", "Боня", "Вита", "Голди", "Джес", "Ева", "Жужа", "Зара", "Ирма", "Кира", "Кики", "Лора", "Марта", "Нора", "Рада", "Соня", "Тося", "Феня", "Хася", "Чара",
]

const dogNamesMale = [
    "Макс", "Чарли", "Альф", "Лео", "Ник", "Оскар", "Рекс", "Сёма", "Том", "Чак", "Шрек", "Ярик", "Арчи", "Буч", "Веня", "Грей", "Джек", "Жорик", "Зак", "Каспер",
]

const dogNames = [
    ...dogNamesFemale,
    ...dogNamesMale,
]

export function getRandomName(dog?: boolean) {
    const taken = players.data.map(function ({ data: { name } }) {
        return name
    })
    let index

    const n = dog ? dogNames : names

    do {
        index = getRandomInt(0, n.length - 1)
    } while (taken.includes(n[index]))

    return n[index]
}
